Autodesk.Navisworks.Api.Schema.StructField
Represents the definition of a structure within a Autodesk.Navisworks.Api.Schema.SchemaDefinition.

Autodesk.Navisworks.Api.Schema.StructField.#ctor
Default constructor. No identifier specified.

Autodesk.Navisworks.Api.Schema.StructField.#ctor(System.String)
Constructs the field with a given identifier.
Throws System.ArgumentException:
Provided field ID is invalid or missing. 7-bit ASCII without spaces must be used.
Throws System.ArgumentException:
Argument 'id' is not convertable to a 7-bit ASCII string

Autodesk.Navisworks.Api.Schema.StructField.Fields
The fields that comprise the struct content.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.StructField.IsReadOnly
Gets a value indicating whether the object is read-only.